<template>
  <div>
    <d-watermark>
      <div class="content">
        <!-- 你的其他内容 -->
        <h1>这是简单的页面</h1>
        <p>内容会显示在水印下方</p>
      </div>
    </d-watermark>
    <d-watermark
      :text="'Confidential'"
      :fontSize="'30px'"
      :opacity="0.1"
      :angle="45"
      style="margin-top: 100px"
    >
      <div class="content cus-content">
        <!-- 你的其他内容 -->
        <h1>这是自定义好的一个页面</h1>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
      </div>
    </d-watermark>
    <d-watermark
      :imageUrl="imgUrl"
      :imageWidth="150"
      :imageHeight="150"
      :angle="-30"
      :opacity="0.1"
      :watermarkType="'image'"
    >
    <div class="content cus-content">
        <!-- 你的其他内容 -->
        <h1>这是自定义好的一个页面</h1>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
        <p>
          内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方内容会显示在水印下方
        </p>
      </div>
  </d-watermark>

  </div>
</template>

<script>
import imgUrl from '../../assets/logo.png'
export default {
  data(){
    return {
      imgUrl: imgUrl
    }
  }
}
</script>

<style>
.content {
  padding: 50px;
}

.cus-content {
  /* height: 800px; */
  /* overflow-y: auto; */
}
</style>
